Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_regdef.h
/** \brief Configuration Register 0 */
typedef struct _Ifx_MTU_MC_CONFIG0_Bits
{
    Ifx_Strict_16Bit ACCSTYPE:8;        /**< \brief [7:0] Access type - ACCSTYPE (rw) */
    Ifx_Strict_16Bit reserved_8:4;      /**< \brief [11:8] \internal Reserved */
    Ifx_Strict_16Bit NUMACCS:4;         /**< \brief [15:12] Number of accesses per address - NUMACCS (rw) */
} Ifx_MTU_MC_CONFIG0_Bits;

/** \brief Configuration Register 1 */
typedef struct _Ifx_MTU_MC_CONFIG1_Bits
{
    Ifx_Strict_16Bit ACCSPAT:8;         /**< \brief [7:0] Access pattern - ACCSPAT (rw) */
    Ifx_Strict_16Bit SELFASTB:4;        /**< \brief [11:8] Select Fast Bit - SELFASTB (rw) */
    Ifx_Strict_16Bit AG_MOD:4;          /**< \brief [15:12] Address Generator Mode - AG_MOD (rw) */
} Ifx_MTU_MC_CONFIG1_Bits;

/** \brief Memory ECC Detection Register */
typedef struct _Ifx_MTU_MC_ECCD_Bits
{
    Ifx_Strict_16Bit SERR:1;            /**< \brief [0:0] Error Detected - SERR (rwh) */
    Ifx_Strict_16Bit CERR:1;            /**< \brief [1:1] Correctable Error Detected - CERR (rwh) */
    Ifx_Strict_16Bit UERR:1;            /**< \brief [2:2] Uncorrectable Error Detected - UERR (rwh) */
    Ifx_Strict_16Bit AERR:1;            /**< \brief [3:3] Address Error Detected - AERR (rwh) */
    Ifx_Strict_16Bit TRC:1;             /**< \brief [4:4] Tracking Clear - TRC (w) */
    Ifx_Strict_16Bit VAL:5;             /**< \brief [9:5] Valid Bits - VAL (rh) */
    Ifx_Strict_16Bit reserved_10:1;     /**< \brief [10:10] \internal Reserved */
    Ifx_Strict_16Bit reserved_11:4;     /**< \brief [14:11] \internal Reserved */
    Ifx_Strict_16Bit EOV:1;             /**< \brief [15:15] Error Overflow - EOV (rh) */
} Ifx_MTU_MC_ECCD_Bits;

/** \brief ECC Safety Register */
typedef struct _Ifx_MTU_MC_ECCS_Bits
{
    Ifx_Strict_16Bit CENE:1;            /**< \brief [0:0] Correctable Error Notification Enable - CENE (rw) */
    Ifx_Strict_16Bit UENE:1;            /**< \brief [1:1] Uncorrectable Error Notification Enable - UENE (rw) */
    Ifx_Strict_16Bit AENE:1;            /**< \brief [2:2] Address Error Notification Enable - AENE (rw) */
    Ifx_Strict_16Bit ECE:1;             /**< \brief [3:3] Error Correction Enable - ECE (rw) */
    Ifx_Strict_16Bit TRE:1;             /**< \brief [4:4] Tracking Enable - TRE (rw) */
    Ifx_Strict_16Bit BFLE:1;            /**< \brief [5:5] Bit Flip Enable - BFLE (rw) */
    Ifx_Strict_16Bit SFLE:2;            /**< \brief [7:6] Signature Bit Flip Enables - SFLE (rw) */
    Ifx_Strict_16Bit ECCMAP:2;          /**< \brief [9:8] ECC Bit Mapping Mode - ECCMAP (rw) */
    Ifx_Strict_16Bit TC_TWR_SEL:1;      /**< \brief [10:10] TriCore Tower Select - TC_TWR_SEL (rw) */
    Ifx_Strict_16Bit reserved_11:5;     /**< \brief [15:11] \internal Reserved */
} Ifx_MTU_MC_ECCS_Bits;

/** \brief Error Information Register ${x} */
typedef struct _Ifx_MTU_MC_ERRINFO_Bits
{
    Ifx_Strict_16Bit CERR:1;            /**< \brief [0:0] Correctable Error Detected - CERR (rh) */
    Ifx_Strict_16Bit UERR:1;            /**< \brief [1:1] Uncorrectable Error Detected - UERR (rh) */
    Ifx_Strict_16Bit AERR:1;            /**< \brief [2:2] Address Error Detected - AERR (rh) */
    Ifx_Strict_16Bit reserved_3:13;     /**< \brief [15:3] \internal Reserved */
} Ifx_MTU_MC_ERRINFO_Bits;

/** \brief Error Tracking Register ${x} */
typedef struct _Ifx_MTU_MC_ETRR_Bits
{
    Ifx_Strict_16Bit ADDR:13;           /**< \brief [12:0] Address of Error(i) - ADDR (rh) */
    Ifx_Strict_16Bit MBI:3;             /**< \brief [15:13] Memory Block Index of Error(i) - MBI (rh) */
} Ifx_MTU_MC_ETRR_Bits;

/** \brief MBIST Control Register */
typedef struct _Ifx_MTU_MC_MCONTROL_Bits
{
    Ifx_Strict_16Bit START:1;           /**< \brief [0:0] START - START (rw) */
    Ifx_Strict_16Bit RESUME:1;          /**< \brief [1:1] Resume failed test - RESUME (rwh) */
    Ifx_Strict_16Bit ESTF:1;            /**< \brief [2:2] Enable Sticky Fail Bit - ESTF (rw) */
    Ifx_Strict_16Bit DIR:1;             /**< \brief [3:3] Direction Select - DIR (rw) */
    Ifx_Strict_16Bit DINIT:1;           /**< \brief [4:4] Data Initialization Enable - DINIT (rw) */
    Ifx_Strict_16Bit RCADR:1;           /**< \brief [5:5] Fast Row / Fast Column Addressing Scheme Select - RCADR (rw) */
    Ifx_Strict_16Bit ROWTOG:1;          /**< \brief [6:6] Row toggling - ROWTOG (rw) */
    Ifx_Strict_16Bit BITTOG:1;          /**< \brief [7:7] Bit toggling - BITTOG (rw) */
    Ifx_Strict_16Bit GP_BASE:1;         /**< \brief [8:8] Galpat Base - GP_BASE (rw) */
    Ifx_Strict_16Bit FAILDMP:1;         /**< \brief [9:9] Fail bitmap dump - FAILDMP (rw) */
    Ifx_Strict_16Bit EN_DESCR:1;        /**< \brief [10:10] Enable De-Scrambling - EN_DESCR (rw) */
    Ifx_Strict_16Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_Strict_16Bit INITRED:1;         /**< \brief [12:12] Initialize Redundancy Settings - INITRED (rw) */
    Ifx_Strict_16Bit LDRED:1;           /**< \brief [13:13] Load Redundancy - LDRED (rw) */
    Ifx_Strict_16Bit USERED:1;          /**< \brief [14:14] Use Redundancy - USERED (rw) */
    Ifx_Strict_16Bit SRAM_CLR:1;        /**< \brief [15:15] Clear the SRAM - SRAM_CLR (rw) */
} Ifx_MTU_MC_MCONTROL_Bits;

/** \brief Status Register */
typedef struct _Ifx_MTU_MC_MSTATUS_Bits
{
    Ifx_Strict_16Bit DONE:1;            /**< \brief [0:0] DONE - DONE (rh) */
    Ifx_Strict_16Bit FAIL:1;            /**< \brief [1:1] FAIL - FAIL (rh) */
    Ifx_Strict_16Bit FDA:1;             /**< \brief [2:2] Fail Dump Available - FDA (rh) */
    Ifx_Strict_16Bit SFAIL:1;           /**< \brief [3:3] Sticky Fail Bit - SFAIL (rh) */
    Ifx_Strict_16Bit reserved_4:12;     /**< \brief [15:4] \internal Reserved */
} Ifx_MTU_MC_MSTATUS_Bits;

/** \brief Range Register, single address mode */
typedef struct _Ifx_MTU_MC_RANGE_Bits
{
    Ifx_Strict_16Bit ADDR:14;           /**< \brief [13:0] Address - ADDR (rw) */
    Ifx_Strict_16Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_Strict_16Bit RAEN:1;            /**< \brief [15:15] Range Enable - RAEN (rw) */
} Ifx_MTU_MC_RANGE_Bits;


/** \brief Read Data and Bit Flip Register ${y} */
typedef struct _Ifx_MTU_MC_RDBFL_Bits
{
    Ifx_Strict_16Bit WDATA:16;          /**< \brief [15:0] Word Data - WDATA (rwh) */
} Ifx_MTU_MC_RDBFL_Bits;

/** \brief Revision ID Register */
typedef struct _Ifx_MTU_MC_REVID_Bits
{
    Ifx_Strict_16Bit REV_ID:16;         /**< \brief [15:0] Revision Identifier - REV_ID (r) */
} Ifx_MTU_MC_REVID_Bits;

