Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_regdef.h
/** \brief Memory MBISTEnable Register 0 */
typedef struct _Ifx_MTU_MEMDONE0_Bits
{
    Ifx_UReg_32Bit CPU0_DMEM_DONE:1;    /**< \brief [0:0] CPU0 DMEM Test Done Status - CPU0_DMEM_DONE (rh) */
    Ifx_UReg_32Bit CPU0_DTAG_DONE:1;    /**< \brief [1:1] CPU0 DTAG Test Done Status - CPU0_DTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU0_PMEM_DONE:1;    /**< \brief [2:2] CPU0 PMEM Test Done Status - CPU0_PMEM_DONE (rh) */
    Ifx_UReg_32Bit CPU0_PTAG_DONE:1;    /**< \brief [3:3] CPU0 PTAG Test Done Status - CPU0_PTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU2PCEN:1;        /**< \brief [4:4] CPU2 TC1.6P PCACHE MBIST Controller Memory Enable (TC2Dx and A-Step only) - CPU2PCEN (rwh) */
    Ifx_UReg_32Bit CPU1_DMEM_DONE:1;    /**< \brief [5:5] CPU1 DMEM Test Done Status - CPU1_DMEM_DONE (rh) */
    Ifx_UReg_32Bit CPU1_DTAG_DONE:1;    /**< \brief [6:6] CPU1 DTAG Test Done Status - CPU1_DTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU1_PMEM_DONE:1;    /**< \brief [7:7] CPU1 PMEM Test Done Status - CPU1_PMEM_DONE (rh) */
    Ifx_UReg_32Bit CPU1_PTAG_DONE:1;    /**< \brief [8:8] CPU1 PTAG Test Done Status - CPU1_PTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU1_DLMU_STBY_DONE:1;    /**< \brief [9:9] CPU1 STANDBY DLMU Test Done Status - CPU1_DLMU_STBY_DONE (rh) */
    Ifx_UReg_32Bit CPU2_DMEM_DONE:1;    /**< \brief [10:10] CPU2 DMEM Test Done Status - CPU2_DMEM_DONE (rh) */
    Ifx_UReg_32Bit CPU2_DTAG_DONE:1;    /**< \brief [11:11] CPU2 DTAG Test Done Status - CPU2_DTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU2_PMEM_DONE:1;    /**< \brief [12:12] CPU2 PMEM Test Done Status - CPU2_PMEM_DONE (rh) */
    Ifx_UReg_32Bit CPU2_PTAG_DONE:1;    /**< \brief [13:13] CPU2 PTAG Test Done Status - CPU2_PTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU2_DLMU_DONE:1;    /**< \brief [14:14] CPU2 DLMU memory Test Done Status - CPU2_DLMU_DONE (rh) */
    Ifx_UReg_32Bit CPU0PCEN:1;        /**< \brief [15:15] CPU0 PCACHE MBIST Controller Memory Enable (TC2Dx and A-Step Only) - CPU0PCEN (rwh) */
    Ifx_UReg_32Bit CPU3_DTAG_DONE:1;    /**< \brief [16:16] CPU3 DTAG Test Done Status - CPU3_DTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU3_PMEM_DONE:1;    /**< \brief [17:17] CPU3 PMEM Test Done Status - CPU3_PMEM_DONE (rh) */
    Ifx_UReg_32Bit CPU3_PTAG_DONE:1;    /**< \brief [18:18] CPU3 PTAG Test Done Status - CPU3_PTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU1PCEN:1;        /**< \brief [19:19] CPU1 TC1.6E (TC2Dx Only ) PCACHE MBIST Controller Memory Enable - CPU1PCEN (rwh) */
    Ifx_UReg_32Bit CPU1PSEN:1;        /**< \brief [20:20] CPU1 TC1.6E (TC2Dx Only) PSPR MBIST Controller Memory Enable - CPU1PSEN (rwh) */
    Ifx_UReg_32Bit CPU1PTEN:1;        /**< \brief [21:21] CPU1 TC1.6E (TC2Dx Only) PTAG MBIST Controller Memory Enable - CPU1PTEN (rwh) */
    Ifx_UReg_32Bit reserved_22:1;     /**< \brief [22:22] \internal Reserved */
    Ifx_UReg_32Bit CPU4_PTAG_DONE:1;    /**< \brief [23:23] CPU4 PTAG Test Done Status - CPU4_PTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU4_DLMU_DONE:1;    /**< \brief [24:24] CPU4 DLMU memory Test Done Status - CPU4_DLMU_DONE (rh) */
    Ifx_UReg_32Bit CPU5_DMEM_DONE:1;    /**< \brief [25:25] CPU5 DMEM Test Done Status - CPU5_DMEM_DONE (rh) */
    Ifx_UReg_32Bit CPU5_DTAG_DONE:1;    /**< \brief [26:26] CPU5 DTAG Test Done Status - CPU5_DTAG_DONE (rh) */
    Ifx_UReg_32Bit CPU5_PMEM_DONE:1;    /**< \brief [27:27] CPU5 PMEM Test Done Status - CPU5_PMEM_DONE (rh) */
    Ifx_UReg_32Bit reserved_28:1;     /**< \brief [28:28] \internal Reserved */
    Ifx_UReg_32Bit reserved_29:1;     /**< \brief [29:29] \internal Reserved */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit reserved_31:1;     /**< \brief [31:31] \internal Reserved */
} Ifx_MTU_MEMDONE0_Bits;

/** \brief Memory Test Done Status Register 1 */
typedef struct _Ifx_MTU_MEMDONE1_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit reserved_2:4;      /**< \brief [5:2] \internal Reserved */
    Ifx_UReg_32Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit reserved_8:1;      /**< \brief [8:8] \internal Reserved */
    Ifx_UReg_32Bit SADMA_DONE:1;      /**< \brief [9:9] SADMA Test Done Status - SADMA_DONE (rh) */
    Ifx_UReg_32Bit MINI_MCDS_DONE:1;    /**< \brief [10:10] MINI MCDS memory Test Done Status - MINI_MCDS_DONE (rh) */
    Ifx_UReg_32Bit MCDS_DONE:1;       /**< \brief [11:11] MCDS memory Test Done Status - MCDS_DONE (rh) */
    Ifx_UReg_32Bit EMEM0_DONE:1;      /**< \brief [12:12] EMEM0 Test Done Status - EMEM0_DONE (rh) */
    Ifx_UReg_32Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_32Bit EMEM2_DONE:1;      /**< \brief [14:14] EMEM2 Test Done Status - EMEM2_DONE (rh) */
    Ifx_UReg_32Bit EMEM3_DONE:1;      /**< \brief [15:15] EMEM3 Test Done Status - EMEM3_DONE (rh) */
    Ifx_UReg_32Bit EMEM_XTM_DONE:1;    /**< \brief [16:16] EMEM XTM memory Test Done Status - EMEM_XTM_DONE (rh) */
    Ifx_UReg_32Bit SPU_BUFFER0_DONE:1;    /**< \brief [17:17] SPU BUFFER0 Test Done Status - SPU_BUFFER0_DONE (rh) */
    Ifx_UReg_32Bit SPU_BUFFER1_DONE:1;    /**< \brief [18:18] SPU BUFFER1 Test Done Status - SPU_BUFFER1_DONE (rh) */
    Ifx_UReg_32Bit SPU_CONFIG0_DONE:1;    /**< \brief [19:19] SPU CONFIG0 memory Test Done Status - SPU_CONFIG0_DONE (rh) */
    Ifx_UReg_32Bit SPU_CONFIG1_DONE:1;    /**< \brief [20:20] SPU CONFIG1 memory Test Done Status - SPU_CONFIG1_DONE (rh) */
    Ifx_UReg_32Bit GTM_FIFO_DONE:1;    /**< \brief [21:21] GTM FIFO memory Test Done Status - GTM_FIFO_DONE (rh) */
    Ifx_UReg_32Bit GTM_MCS0SLOW_DONE:1;    /**< \brief [22:22] GTM MCS0 SLOW memory Test Done Status - GTM_MCS0SLOW_DONE (rh) */
    Ifx_UReg_32Bit GTM_MCS0FAST_DONE:1;    /**< \brief [23:23] GTM MCS0 FAST memory Test Done Status - GTM_MCS0FAST_DONE (rh) */
    Ifx_UReg_32Bit GTM_MCS1SLOW_DONE:1;    /**< \brief [24:24] GTM MCS1 SLOW memory Test Done Status - GTM_MCS1SLOW_DONE (rh) */
    Ifx_UReg_32Bit GTM_MCS1FAST_DONE:1;    /**< \brief [25:25] GTM MCS1 FAST memory Test Done Status - GTM_MCS1FAST_DONE (rh) */
    Ifx_UReg_32Bit GTM_DPLL1A_DONE:1;    /**< \brief [26:26] GTM DPLL1A memory Test Done Status - GTM_DPLL1A_DONE (rh) */
    Ifx_UReg_32Bit GTM_DPLL1BC_DONE:1;    /**< \brief [27:27] GTM DPLL1BC memory Test Done Status - GTM_DPLL1BC_DONE (rh) */
    Ifx_UReg_32Bit GTM_DPLL2_DONE:1;    /**< \brief [28:28] GTM DPLL2 memory Test Done Status - GTM_DPLL2_DONE (rh) */
    Ifx_UReg_32Bit ETHERMAC_DONE:1;    /**< \brief [29:29] ETHERMAC memory Test Done Status - ETHERMAC_DONE (rh) */
    Ifx_UReg_32Bit MCAN10_DONE:1;     /**< \brief [30:30] MCAN10 memory Test Done Status - MCAN10_DONE (rh) */
    Ifx_UReg_32Bit MCAN11_DONE:1;     /**< \brief [31:31] MCAN11 memory Test Done Status - MCAN11_DONE (rh) */
} Ifx_MTU_MEMDONE1_Bits;

