Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_regdef.h
/** \brief Memory Test Done Status Register 2 */
typedef struct _Ifx_MTU_MEMDONE2_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit ERAY_OBF0_DONE:1;    /**< \brief [2:2] ERAY OBF0 Test Done Status - ERAY_OBF0_DONE (rh) */
    Ifx_UReg_32Bit ERAY_OBF1_DONE:1;    /**< \brief [3:3] ERAY OBF1 Test Done Status - ERAY_OBF1_DONE (rh) */
    Ifx_UReg_32Bit ERAY_TBF_IBF0_DONE:1;    /**< \brief [4:4] ERAY TBF IBF0 memory Test Done Status - ERAY_TBF_IBF0_DONE (rh) */
    Ifx_UReg_32Bit ERAY_TBF_IBF1_DONE:1;    /**< \brief [5:5] ERAY TBF IBF1 memory Test Done Status - ERAY_TBF_IBF1_DONE (rh) */
    Ifx_UReg_32Bit ERAY_MBF0_DONE:1;    /**< \brief [6:6] ERAY MBF0 memory Test Done Status - ERAY_MBF0_DONE (rh) */
    Ifx_UReg_32Bit ERAY_MBF1_DONE:1;    /**< \brief [7:7] ERAY MBF1 memory Test Done Status - ERAY_MBF1_DONE (rh) */
    Ifx_UReg_32Bit reserved_8:1;    /**< \brief [8:8] \internal Reserved */
    Ifx_UReg_32Bit reserved_9:1;    /**< \brief [9:9] \internal Reserved */
    Ifx_UReg_32Bit reserved_10:1;    /**< \brief [10:10] \internal Reserved */
    Ifx_UReg_32Bit reserved_11:1;    /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit reserved_12:1;    /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit SCR_XRAM_DONE:1;    /**< \brief [13:13] SCR XRAM Test Done Status - SCR_XRAM_DONE (rh) */
    Ifx_UReg_32Bit SCR_RAMINT_DONE:1;    /**< \brief [14:14] SCR Internal RAM Test Done Status - SCR_RAMINT_DONE (rh) */
    Ifx_UReg_32Bit CIF_JPEG1_4_DONE:1;    /**< \brief [15:15] CIF JPEG_1_4 memoryTest Done Status - CIF_JPEG1_4_DONE (rh) */
    Ifx_UReg_32Bit CIF_JPEG3_DONE:1;    /**< \brief [16:16] CIF JPEG3 memoryTest Done Status - CIF_JPEG3_DONE (rh) */
    Ifx_UReg_32Bit CIF_DONE:1;        /**< \brief [17:17] CIF memoryTest Done Status - CIF_DONE (rh) */
    Ifx_UReg_32Bit reserved_18:1;     /**< \brief [18:18] \internal Reserved */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit reserved_20:1;     /**< \brief [20:20] \internal Reserved */
    Ifx_UReg_32Bit HSPDM_RAM_DONE:1;    /**< \brief [21:21] HDSPDM RAM Test Done Status - HSPDM_RAM_DONE (rh) */
    Ifx_UReg_32Bit reserved_22:2;     /**< \brief [23:22] \internal Reserved */
    Ifx_UReg_32Bit SPU_FFT00_RAM_DONE:1;    /**< \brief [24:24] SPU FFT00 RAM Test Done Status - SPU_FFT00_RAM_DONE (rh) */
    Ifx_UReg_32Bit SPU_FFT01_RAM_DONE:1;    /**< \brief [25:25] SPU FFT01 RAM Test Done Status - SPU_FFT01_RAM_DONE (rh) */
    Ifx_UReg_32Bit SPU_FFT10_RAM_DONE:1;    /**< \brief [26:26] SPU FFT10 RAM Test Done Status - SPU_FFT10_RAM_DONE (rh) */
    Ifx_UReg_32Bit SPU_FFT11_RAM_DONE:1;    /**< \brief [27:27] SPU FFT11 RAM Test Done Status - SPU_FFT11_RAM_DONE (rh) */
    Ifx_UReg_32Bit SPU_FFT20_RAM_DONE:1;    /**< \brief [28:28] SPU FFT20 RAM Test Done Status - SPU_FFT20_RAM_DONE (rh) */
    Ifx_UReg_32Bit SPU_FFT21_RAM_DONE:1;    /**< \brief [29:29] SPU FFT21 RAM Test Done Status - SPU_FFT21_RAM_DONE (rh) */
    Ifx_UReg_32Bit SPU_FFT30_RAM_DONE:1;    /**< \brief [30:30] SPU FFT30 RAM Test Done Status - SPU_FFT30_RAM_DONE (rh) */
    Ifx_UReg_32Bit SPU_FFT31_RAM_DONE:1;    /**< \brief [31:31] SPU FFT31 RAM Test Done Status - SPU_FFT31_RAM_DONE (rh) */
} Ifx_MTU_MEMDONE2_Bits;

/** \brief Memory Test FDA Status Register 0 */
typedef struct _Ifx_MTU_MEMFDA0_Bits
{
    Ifx_UReg_32Bit CPU0_DMEM_FDA:1;    /**< \brief [0:0] CPU0 DMEM Test FDA Status - CPU0_DMEM_FDA (rh) */
    Ifx_UReg_32Bit CPU0_DTAG_FDA:1;    /**< \brief [1:1] CPU0 DTAG Test FDA Status - CPU0_DTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU0_PMEM_FDA:1;    /**< \brief [2:2] CPU0 PMEM Test FDA Status - CPU0_PMEM_FDA (rh) */
    Ifx_UReg_32Bit CPU0_PTAG_FDA:1;    /**< \brief [3:3] CPU0 PTAG Test FDA Status - CPU0_PTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU2PCEN:1;        /**< \brief [4:4] CPU2 TC1.6P PCACHE MBIST Controller Memory Enable (TC2Dx and A-Step only) - CPU2PCEN (rwh) */
    Ifx_UReg_32Bit CPU1_DMEM_FDA:1;    /**< \brief [5:5] CPU1 DMEM Test FDA Status - CPU1_DMEM_FDA (rh) */
    Ifx_UReg_32Bit CPU1_DTAG_FDA:1;    /**< \brief [6:6] CPU1 DTAG Test FDA Status - CPU1_DTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU1_PMEM_FDA:1;    /**< \brief [7:7] CPU1 PMEM Test FDA Status - CPU1_PMEM_FDA (rh) */
    Ifx_UReg_32Bit CPU1_PTAG_FDA:1;    /**< \brief [8:8] CPU1 PTAG Test FDA Status - CPU1_PTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU1_DLMU_STBY_FDA:1;    /**< \brief [9:9] CPU1 STANDBY DLMU Test FDA Status - CPU1_DLMU_STBY_FDA (rh) */
    Ifx_UReg_32Bit CPU2_DMEM_FDA:1;    /**< \brief [10:10] CPU2 DMEM Test FDA Status - CPU2_DMEM_FDA (rh) */
    Ifx_UReg_32Bit CPU2_DTAG_FDA:1;    /**< \brief [11:11] CPU2 DTAG Test FDA Status - CPU2_DTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU2_PMEM_FDA:1;    /**< \brief [12:12] CPU2 PMEM Test FDA Status - CPU2_PMEM_FDA (rh) */
    Ifx_UReg_32Bit CPU2_PTAG_FDA:1;    /**< \brief [13:13] CPU2 PTAG Test FDA Status - CPU2_PTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU2_DLMU_FDA:1;    /**< \brief [14:14] CPU2 DLMU memory Test FDA Status - CPU2_DLMU_FDA (rh) */
    Ifx_UReg_32Bit CPU0PCEN:1;        /**< \brief [15:15] CPU0 PCACHE MBIST Controller Memory Enable (TC2Dx and A-Step Only) - CPU0PCEN (rwh) */
    Ifx_UReg_32Bit CPU3_DTAG_FDA:1;    /**< \brief [16:16] CPU3 DTAG Test FDA Status - CPU3_DTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU3_PMEM_FDA:1;    /**< \brief [17:17] CPU3 PMEM Test FDA Status - CPU3_PMEM_FDA (rh) */
    Ifx_UReg_32Bit CPU3_PTAG_FDA:1;    /**< \brief [18:18] CPU3 PTAG Test FDA Status - CPU3_PTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU1PCEN:1;        /**< \brief [19:19] CPU1 TC1.6E (TC2Dx Only ) PCACHE MBIST Controller Memory Enable - CPU1PCEN (rwh) */
    Ifx_UReg_32Bit CPU1PSEN:1;        /**< \brief [20:20] CPU1 TC1.6E (TC2Dx Only) PSPR MBIST Controller Memory Enable - CPU1PSEN (rwh) */
    Ifx_UReg_32Bit CPU1PTEN:1;        /**< \brief [21:21] CPU1 TC1.6E (TC2Dx Only) PTAG MBIST Controller Memory Enable - CPU1PTEN (rwh) */
    Ifx_UReg_32Bit reserved_22:1;     /**< \brief [22:22] \internal Reserved */
    Ifx_UReg_32Bit CPU4_PTAG_FDA:1;    /**< \brief [23:23] CPU4 PTAG Test FDA Status - CPU4_PTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU4_DLMU_FDA:1;    /**< \brief [24:24] CPU4 DLMU memory Test FDA Status - CPU4_DLMU_FDA (rh) */
    Ifx_UReg_32Bit CPU5_DMEM_FDA:1;    /**< \brief [25:25] CPU5 DMEM Test FDA Status - CPU5_DMEM_FDA (rh) */
    Ifx_UReg_32Bit CPU5_DTAG_FDA:1;    /**< \brief [26:26] CPU5 DTAG Test FDA Status - CPU5_DTAG_FDA (rh) */
    Ifx_UReg_32Bit CPU5_PMEM_FDA:1;    /**< \brief [27:27] CPU5 PMEM Test FDA Status - CPU5_PMEM_FDA (rh) */
    Ifx_UReg_32Bit reserved_28:1;     /**< \brief [28:28] \internal Reserved */
    Ifx_UReg_32Bit reserved_29:1;     /**< \brief [29:29] \internal Reserved */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit reserved_31:1;     /**< \brief [31:31] \internal Reserved */
} Ifx_MTU_MEMFDA0_Bits;

/** \brief Memory Test FDA Status Register 1 */
typedef struct _Ifx_MTU_MEMFDA1_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit reserved_2:4;      /**< \brief [5:2] \internal Reserved */
    Ifx_UReg_32Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit reserved_8:1;      /**< \brief [8:8] \internal Reserved */
    Ifx_UReg_32Bit SADMA_FDA:1;       /**< \brief [9:9] SADMA Test FDA Status - SADMA_FDA (rh) */
    Ifx_UReg_32Bit MINI_MCDS_FDA:1;    /**< \brief [10:10] MINI MCDS memory Test FDA Status - MINI_MCDS_FDA (rh) */
    Ifx_UReg_32Bit MCDS_FDA:1;        /**< \brief [11:11] MCDS memory Test FDA Status - MCDS_FDA (rh) */
    Ifx_UReg_32Bit EMEM0_FDA:1;       /**< \brief [12:12] EMEM0 Test FDA Status - EMEM0_FDA (rh) */
    Ifx_UReg_32Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_32Bit EMEM2_FDA:1;       /**< \brief [14:14] EMEM2 Test FDA Status - EMEM2_FDA (rh) */
    Ifx_UReg_32Bit EMEM3_FDA:1;       /**< \brief [15:15] EMEM3 Test FDA Status - EMEM3_FDA (rh) */
    Ifx_UReg_32Bit EMEM_XTM_FDA:1;    /**< \brief [16:16] EMEM XTM memory Test FDA Status - EMEM_XTM_FDA (rh) */
    Ifx_UReg_32Bit SPU_BUFFER0_FDA:1;    /**< \brief [17:17] SPU BUFFER0 Test FDA Status - SPU_BUFFER0_FDA (rh) */
    Ifx_UReg_32Bit SPU_BUFFER1_FDA:1;    /**< \brief [18:18] SPU BUFFER1 Test FDA Status - SPU_BUFFER1_FDA (rh) */
    Ifx_UReg_32Bit SPU_CONFIG0_FDA:1;    /**< \brief [19:19] SPU CONFIG0 memory Test FDA Status - SPU_CONFIG0_FDA (rh) */
    Ifx_UReg_32Bit SPU_CONFIG1_FDA:1;    /**< \brief [20:20] SPU CONFIG1 memory Test FDA Status - SPU_CONFIG1_FDA (rh) */
    Ifx_UReg_32Bit GTM_FIFO_FDA:1;    /**< \brief [21:21] GTM FIFO memory Test FDA Status - GTM_FIFO_FDA (rh) */
    Ifx_UReg_32Bit GTM_MCS0SLOW_FDA:1;    /**< \brief [22:22] GTM MCS0 SLOW memory Test FDA Status - GTM_MCS0SLOW_FDA (rh) */
    Ifx_UReg_32Bit GTM_MCS0FAST_FDA:1;    /**< \brief [23:23] GTM MCS0 FAST memory Test FDA Status - GTM_MCS0FAST_FDA (rh) */
    Ifx_UReg_32Bit GTM_MCS1SLOW_FDA:1;    /**< \brief [24:24] GTM MCS1 SLOW memory Test FDA Status - GTM_MCS1SLOW_FDA (rh) */
    Ifx_UReg_32Bit GTM_MCS1FAST_FDA:1;    /**< \brief [25:25] GTM MCS1 FAST memory Test FDA Status - GTM_MCS1FAST_FDA (rh) */
    Ifx_UReg_32Bit GTM_DPLL1A_FDA:1;    /**< \brief [26:26] GTM DPLL1A memory Test FDA Status - GTM_DPLL1A_FDA (rh) */
    Ifx_UReg_32Bit GTM_DPLL1BC_FDA:1;    /**< \brief [27:27] GTM DPLL1BC memory Test FDA Status - GTM_DPLL1BC_FDA (rh) */
    Ifx_UReg_32Bit GTM_DPLL2_FDA:1;    /**< \brief [28:28] GTM DPLL2 memory Test FDA Status - GTM_DPLL2_FDA (rh) */
    Ifx_UReg_32Bit ETHERMAC_FDA:1;    /**< \brief [29:29] ETHERMAC memory Test FDA Status - ETHERMAC_FDA (rh) */
    Ifx_UReg_32Bit MCAN10_FDA:1;      /**< \brief [30:30] MCAN10 memory Test FDA Status - MCAN10_FDA (rh) */
    Ifx_UReg_32Bit MCAN11_FDA:1;      /**< \brief [31:31] MCAN11 memory Test FDA Status - MCAN11_FDA (rh) */
} Ifx_MTU_MEMFDA1_Bits;

/** \brief Memory Test FDA Status Register 2 */
typedef struct _Ifx_MTU_MEMFDA2_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit reserved_2:1;      /**< \brief [2:2] \internal Reserved */
    Ifx_UReg_32Bit ERAY_OBF1_FDA:1;    /**< \brief [3:3] ERAY OBF1 Test FDA Status - ERAY_OBF1_FDA (rh) */
    Ifx_UReg_32Bit ERAY_TBF_IBF0_FDA:1;    /**< \brief [4:4] ERAY TBF IBF0 memory Test FDA Status - ERAY_TBF_IBF0_FDA (rh) */
    Ifx_UReg_32Bit ERAY_TBF_IBF1_FDA:1;    /**< \brief [5:5] ERAY TBF IBF1 memory Test FDA Status - ERAY_TBF_IBF1_FDA (rh) */
    Ifx_UReg_32Bit ERAY_MBF0_FDA:1;    /**< \brief [6:6] ERAY MBF0 memory Test FDA Status - ERAY_MBF0_FDA (rh) */
    Ifx_UReg_32Bit ERAY_MBF1_FDA:1;    /**< \brief [7:7] ERAY MBF1 memory Test FDA Status - ERAY_MBF1_FDA (rh) */
    Ifx_UReg_32Bit reserved_8:1;      /**< \brief [8:8] \internal Reserved */
    Ifx_UReg_32Bit reserved_9:1;     /**< \brief [9:9] \internal Reserved */
    Ifx_UReg_32Bit reserved_10:1;    /**< \brief [10:10] \internal Reserved */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit reserved_12:1;     /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit SCR_XRAM_FDA:1;    /**< \brief [13:13] SCR XRAM Test FDA Status - SCR_XRAM_FDA (rh) */
    Ifx_UReg_32Bit SCR_RAMINT_FDA:1;    /**< \brief [14:14] SCR Internal RAM Test FDA Status - SCR_RAMINT_FDA (rh) */
    Ifx_UReg_32Bit CIF_JPEG1_4_FDA:1;    /**< \brief [15:15] CIF JPEG_1_4 memoryTest FDA Status - CIF_JPEG1_4_FDA (rh) */
    Ifx_UReg_32Bit CIF_JPEG3_FDA:1;    /**< \brief [16:16] CIF JPEG3 memoryTest FDA Status - CIF_JPEG3_FDA (rh) */
    Ifx_UReg_32Bit CIF_FDA:1;         /**< \brief [17:17] CIF memoryTest FDA Status - CIF_FDA (rh) */
    Ifx_UReg_32Bit reserved_18:1;     /**< \brief [18:18] \internal Reserved */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit reserved_20:1;     /**< \brief [20:20] \internal Reserved */
    Ifx_UReg_32Bit HSPDM_RAM_FDA:1;    /**< \brief [21:21] HDSPDM RAM Test FDA Status - HSPDM_RAM_FDA (rh) */
    Ifx_UReg_32Bit reserved_22:2;     /**< \brief [23:22] \internal Reserved */
    Ifx_UReg_32Bit SPU_FFT00_RAM_FDA:1;    /**< \brief [24:24] SPU FFT00 RAM Test FDA Status - SPU_FFT00_RAM_FDA (rh) */
    Ifx_UReg_32Bit SPU_FFT01_RAM_FDA:1;    /**< \brief [25:25] SPU FFT01 RAM Test FDA Status - SPU_FFT01_RAM_FDA (rh) */
    Ifx_UReg_32Bit SPU_FFT10_RAM_FDA:1;    /**< \brief [26:26] SPU FFT10 RAM Test FDA Status - SPU_FFT10_RAM_FDA (rh) */
    Ifx_UReg_32Bit SPU_FFT11_RAM_FDA:1;    /**< \brief [27:27] SPU FFT11 RAM Test FDA Status - SPU_FFT11_RAM_FDA (rh) */
    Ifx_UReg_32Bit SPU_FFT20_RAM_FDA:1;    /**< \brief [28:28] SPU FFT20 RAM Test FDA Status - SPU_FFT20_RAM_FDA (rh) */
    Ifx_UReg_32Bit SPU_FFT21_RAM_FDA:1;    /**< \brief [29:29] SPU FFT21 RAM Test FDA Status - SPU_FFT21_RAM_FDA (rh) */
    Ifx_UReg_32Bit SPU_FFT30_RAM_FDA:1;    /**< \brief [30:30] SPU FFT30 RAM Test FDA Status - SPU_FFT30_RAM_FDA (rh) */
    Ifx_UReg_32Bit SPU_FFT31_RAM_FDA:1;    /**< \brief [31:31] SPU FFT31 RAM Test FDA Status - SPU_FFT31_RAM_FDA (rh) */
} Ifx_MTU_MEMFDA2_Bits;

/** \brief Memory Mapping Enable Register */
typedef struct _Ifx_MTU_MEMMAP_Bits
{
    Ifx_UReg_32Bit CPU0_DCMAP:1;      /**< \brief [0:0] CPU0 DCache Mapping - CPU0_DCMAP (rwh) */
    Ifx_UReg_32Bit CPU0_DTMAP:1;      /**< \brief [1:1] CPU0 DTAG Mapping - CPU0_DTMAP (rh) */
    Ifx_UReg_32Bit CPU0_PCMAP:1;      /**< \brief [2:2] CPU0 PCACHE Mapping - CPU0_PCMAP (rwh) */
    Ifx_UReg_32Bit CPU0_PTMAP:1;      /**< \brief [3:3] CPU0 PTAG Mapping - CPU0_PTMAP (rh) */
    Ifx_UReg_32Bit reserved_4:1;      /**< \brief [4:4] \internal Reserved */
    Ifx_UReg_32Bit CPU1_DCMAP:1;      /**< \brief [5:5] CPU1 DCache Mapping - CPU1_DCMAP (rwh) */
    Ifx_UReg_32Bit CPU1_DTMAP:1;      /**< \brief [6:6] CPU1 DTAG Mapping - CPU1_DTMAP (rh) */
    Ifx_UReg_32Bit CPU1_PCMAP:1;      /**< \brief [7:7] CPU1 PCACHE Mapping - CPU1_PCMAP (rwh) */
    Ifx_UReg_32Bit CPU1_PTMAP:1;      /**< \brief [8:8] CPU1 PTAG Mapping - CPU1_PTMAP (rh) */
    Ifx_UReg_32Bit reserved_9:1;      /**< \brief [9:9] \internal Reserved */
    Ifx_UReg_32Bit CPU2_DCMAP:1;      /**< \brief [10:10] CPU2 DCache Mapping - CPU2_DCMAP (rwh) */
    Ifx_UReg_32Bit CPU2_DTMAP:1;      /**< \brief [11:11] CPU2 DTAG Mapping - CPU2_DTMAP (rh) */
    Ifx_UReg_32Bit CPU2_PCMAP:1;      /**< \brief [12:12] CPU2 PCACHE Mapping - CPU2_PCMAP (rwh) */
    Ifx_UReg_32Bit CPU2_PTMAP:1;      /**< \brief [13:13] CPU2 PTAG Mapping - CPU2_PTMAP (rh) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit CPU3_DCMAP:1;      /**< \brief [15:15] CPU3 DCache Mapping - CPU3_DCMAP (rwh) */
    Ifx_UReg_32Bit CPU3_DTMAP:1;      /**< \brief [16:16] CPU3 DTAG Mapping - CPU3_DTMAP (rh) */
    Ifx_UReg_32Bit CPU3_PCMAP:1;      /**< \brief [17:17] CPU3 PCACHE Mapping - CPU3_PCMAP (rwh) */
    Ifx_UReg_32Bit CPU3_PTMAP:1;      /**< \brief [18:18] CPU3 PTAG Mapping - CPU3_PTMAP (rh) */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit CPU4_DCMAP:1;      /**< \brief [20:20] CPU4 DCache Mapping - CPU4_DCMAP (rwh) */
    Ifx_UReg_32Bit CPU4_DTMAP:1;      /**< \brief [21:21] CPU4 DTAG Mapping - CPU4_DTMAP (rh) */
    Ifx_UReg_32Bit CPU4_PCMAP:1;      /**< \brief [22:22] CPU4 PCACHE Mapping - CPU4_PCMAP (rwh) */
    Ifx_UReg_32Bit CPU4_PTMAP:1;      /**< \brief [23:23] CPU4 PTAG Mapping - CPU4_PTMAP (rh) */
    Ifx_UReg_32Bit reserved_24:1;     /**< \brief [24:24] \internal Reserved */
    Ifx_UReg_32Bit CPU5_DCMAP:1;      /**< \brief [25:25] CPU5 DCache Mapping - CPU5_DCMAP (rwh) */
    Ifx_UReg_32Bit CPU5_DTMAP:1;      /**< \brief [26:26] CPU5 DTAG Mapping - CPU5_DTMAP (rh) */
    Ifx_UReg_32Bit CPU5_PCMAP:1;      /**< \brief [27:27] CPU5 PCACHE Mapping - CPU5_PCMAP (rwh) */
    Ifx_UReg_32Bit CPU5_PTMAP:1;      /**< \brief [28:28] CPU5 PTAG Mapping - CPU5_PTMAP (rh) */
    Ifx_UReg_32Bit reserved_29:3;     /**< \brief [31:29] \internal Reserved */
} Ifx_MTU_MEMMAP_Bits;

/** \brief Memory Status Register 0 */
typedef struct _Ifx_MTU_MEMSTAT0_Bits
{
    Ifx_UReg_32Bit CPU0_DMEM_AIU:1;    /**< \brief [0:0] CPU0 DMEM Partial AutoInitialize of Cache Partition Underway - CPU0_DMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU0_DTAG_AIU:1;    /**< \brief [1:1] CPU0 DTAG MBIST AutoInitialize Underway - CPU0_DTAG_AIU (rh) */
    Ifx_UReg_32Bit CPU0_PMEM_AIU:1;    /**< \brief [2:2] CPU0 PMEM Partial AutoInitialize of Cache Partition Underway - CPU0_PMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU0_PTAG_AIU:1;    /**< \brief [3:3] CPU0 PTAG MBIST AutoInitialize Underway - CPU0_PTAG_AIU (rh) */
    Ifx_UReg_32Bit reserved_4:1;      /**< \brief [4:4] \internal Reserved */
    Ifx_UReg_32Bit CPU1_DMEM_AIU:1;    /**< \brief [5:5] CPU1 DMEM Partial AutoInitialize of Cache Partition Underway - CPU1_DMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU1_DTAG_AIU:1;    /**< \brief [6:6] CPU1 DTAG MBIST AutoInitialize Underway - CPU1_DTAG_AIU (rh) */
    Ifx_UReg_32Bit CPU1_PMEM_AIU:1;    /**< \brief [7:7] CPU1 PMEM Partial AutoInitialize of Cache Partition Underway - CPU1_PMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU1_PTAG_AIU:1;    /**< \brief [8:8] CPU1 PTAG MBIST AutoInitialize Underway - CPU1_PTAG_AIU (rh) */
    Ifx_UReg_32Bit reserved_9:1;      /**< \brief [9:9] \internal Reserved */
    Ifx_UReg_32Bit CPU2_DMEM_AIU:1;    /**< \brief [10:10] CPU2 DMEM Partial AutoInitialize of Cache Partition Underway - CPU2_DMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU2_DTAG_AIU:1;    /**< \brief [11:11] CPU2 DTAG MBIST AutoInitialize Underway - CPU2_DTAG_AIU (rh) */
    Ifx_UReg_32Bit CPU2_PMEM_AIU:1;    /**< \brief [12:12] CPU2 PMEM Partial AutoInitialize of Cache Partition Underway - CPU2_PMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU2_PTAG_AIU:1;    /**< \brief [13:13] CPU2 PTAG MBIST AutoInitialize Underway - CPU2_PTAG_AIU (rh) */
    Ifx_UReg_32Bit reserved_14:1;     /**< \brief [14:14] \internal Reserved */
    Ifx_UReg_32Bit CPU3_DMEM_AIU:1;    /**< \brief [15:15] CPU3 DMEM Partial AutoInitialize of Cache Partition Underway - CPU3_DMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU3_DTAG_AIU:1;    /**< \brief [16:16] CPU3 DTAG MBIST AutoInitialize Underway - CPU3_DTAG_AIU (rh) */
    Ifx_UReg_32Bit CPU3_PMEM_AIU:1;    /**< \brief [17:17] CPU3 PMEM Partial AutoInitialize of Cache Partition Underway - CPU3_PMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU3_PTAG_AIU:1;    /**< \brief [18:18] CPU3 PTAG MBIST AutoInitialize Underway - CPU3_PTAG_AIU (rh) */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit CPU4_DMEM_AIU:1;    /**< \brief [20:20] CPU4 DMEM Partial AutoInitialize of Cache Partition Underway - CPU4_DMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU4_DTAG_AIU:1;    /**< \brief [21:21] CPU4 DTAG MBIST AutoInitialize Underway - CPU4_DTAG_AIU (rh) */
    Ifx_UReg_32Bit CPU4_PMEM_AIU:1;    /**< \brief [22:22] CPU4 PMEM Partial AutoInitialize of Cache Partition Underway - CPU4_PMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU4_PTAG_AIU:1;    /**< \brief [23:23] CPU4 PTAG MBIST AutoInitialize Underway - CPU4_PTAG_AIU (rh) */
    Ifx_UReg_32Bit reserved_24:1;     /**< \brief [24:24] \internal Reserved */
    Ifx_UReg_32Bit CPU5_DMEM_AIU:1;    /**< \brief [25:25] CPU5 DMEM Partial AutoInitialize of Cache Partition Underway - CPU5_DMEM_AIU (rh) */
    Ifx_UReg_32Bit reserved_26:1;     /**< \brief [26:26] \internal Reserved */
    Ifx_UReg_32Bit CPU5_PMEM_AIU:1;    /**< \brief [27:27] CPU5 PMEM Partial AutoInitialize of Cache Partition Underway - CPU5_PMEM_AIU (rh) */
    Ifx_UReg_32Bit CPU5_PTAG_AIU:1;    /**< \brief [28:28] CPU5 PTAG MBIST AutoInitialize Underway - CPU5_PTAG_AIU (rh) */
    Ifx_UReg_32Bit reserved_29:3;     /**< \brief [31:29] \internal Reserved */
} Ifx_MTU_MEMSTAT0_Bits;

/** \brief Memory Status Register 1 */
typedef struct _Ifx_MTU_MEMSTAT1_Bits
{
    Ifx_UReg_32Bit reserved_0:8;      /**< \brief [7:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_8:1;         /**< \brief [8:8] \internal Reserved  */
    Ifx_UReg_32Bit reserved_9:23;     /**< \brief [31:9] \internal Reserved */
} Ifx_MTU_MEMSTAT1_Bits;

/** \brief Memory Status Register 2 */
typedef struct _Ifx_MTU_MEMSTAT2_Bits
{
    Ifx_UReg_32Bit reserved_0:8;      /**< \brief [7:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_8:1;    /**< \brief [8:8] \internal Reserved */
    Ifx_UReg_32Bit reserved_9:1;     /**< \brief [9:9] \internal Reserved */
    Ifx_UReg_32Bit reserved_10:1;    /**< \brief [10:10] \internal Reserved */
    Ifx_UReg_32Bit reserved_11:1;     /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit reserved_12:1;     /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_MTU_MEMSTAT2_Bits;

