Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxMtu_regdef.h
/** \brief Memory MBISTEnable Register 0 */
typedef struct _Ifx_MTU_MEMTEST0_Bits
{
    Ifx_UReg_32Bit CPU0_DMEM_EN:1;    /**< \brief [0:0] CPU0 DMEM SSH instance Enable - CPU0_DMEM_EN (rwh) */
    Ifx_UReg_32Bit CPU0_DTAG_EN:1;    /**< \brief [1:1] CPU0 DTAG SSH instance Enable - CPU0_DTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU0_PMEM_EN:1;    /**< \brief [2:2] CPU0 PMEM SSH instance Enable - CPU0_PMEM_EN (rwh) */
    Ifx_UReg_32Bit CPU0_PTAG_EN:1;    /**< \brief [3:3] CPU0 PTAG SSH instance Enable - CPU0_PTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU2PCEN:1;        /**< \brief [4:4] CPU2 TC1.6P PCACHE MBIST Controller Memory Enable (TC2Dx and A-Step only) - CPU2PCEN (rwh) */
    Ifx_UReg_32Bit CPU1_DMEM_EN:1;    /**< \brief [5:5] CPU1 DMEM SSH instance Enable - CPU1_DMEM_EN (rwh) */
    Ifx_UReg_32Bit CPU1_DTAG_EN:1;    /**< \brief [6:6] CPU1 DTAG SSH instance Enable - CPU1_DTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU1_PMEM_EN:1;    /**< \brief [7:7] CPU1 PMEM SSH instance Enable - CPU1_PMEM_EN (rwh) */
    Ifx_UReg_32Bit CPU1_PTAG_EN:1;    /**< \brief [8:8] CPU1 PTAG SSH instance Enable - CPU1_PTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU1_DLMU_STBY_EN:1;    /**< \brief [9:9] CPU1 STANDBY DLMU SSH instance Enable - CPU1_DLMU_STBY_EN (rwh) */
    Ifx_UReg_32Bit CPU2_DMEM_EN:1;    /**< \brief [10:10] CPU2 DMEM SSH instance Enable - CPU2_DMEM_EN (rwh) */
    Ifx_UReg_32Bit CPU2_DTAG_EN:1;    /**< \brief [11:11] CPU2 DTAG SSH instance Enable - CPU2_DTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU2_PMEM_EN:1;    /**< \brief [12:12] CPU2 PMEM SSH instance Enable - CPU2_PMEM_EN (rwh) */
    Ifx_UReg_32Bit CPU2_PTAG_EN:1;    /**< \brief [13:13] CPU2 PTAG SSH instance Enable - CPU2_PTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU2_DLMU_EN:1;    /**< \brief [14:14] CPU2 DLMU memory SSH instance Enable - CPU2_DLMU_EN (rwh) */
    Ifx_UReg_32Bit CPU0PCEN:1;        /**< \brief [15:15] CPU0 PCACHE MBIST Controller Memory Enable (TC2Dx and A-Step Only) - CPU0PCEN (rwh) */
    Ifx_UReg_32Bit CPU3_DTAG_EN:1;    /**< \brief [16:16] CPU3 DTAG SSH instance Enable - CPU3_DTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU3_PMEM_EN:1;    /**< \brief [17:17] CPU3 PMEM SSH instance Enable - CPU3_PMEM_EN (rwh) */
    Ifx_UReg_32Bit CPU3_PTAG_EN:1;    /**< \brief [18:18] CPU3 PTAG SSH instance Enable - CPU3_PTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU1PCEN:1;        /**< \brief [19:19] CPU1 TC1.6E (TC2Dx Only ) PCACHE MBIST Controller Memory Enable - CPU1PCEN (rwh) */
    Ifx_UReg_32Bit CPU1PSEN:1;        /**< \brief [20:20] CPU1 TC1.6E (TC2Dx Only) PSPR MBIST Controller Memory Enable - CPU1PSEN (rwh) */
    Ifx_UReg_32Bit CPU1PTEN:1;        /**< \brief [21:21] CPU1 TC1.6E (TC2Dx Only) PTAG MBIST Controller Memory Enable - CPU1PTEN (rwh) */
    Ifx_UReg_32Bit reserved_22:1;     /**< \brief [22:22] \internal Reserved */
    Ifx_UReg_32Bit CPU4_PTAG_EN:1;    /**< \brief [23:23] CPU4 PTAG SSH instance Enable - CPU4_PTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU4_DLMU_EN:1;    /**< \brief [24:24] CPU4 DLMU memory SSH instance Enable - CPU4_DLMU_EN (rwh) */
    Ifx_UReg_32Bit CPU5_DMEM_EN:1;    /**< \brief [25:25] CPU5 DMEM SSH instance Enable - CPU5_DMEM_EN (rwh) */
    Ifx_UReg_32Bit CPU5_DTAG_EN:1;    /**< \brief [26:26] CPU5 DTAG SSH instance Enable - CPU5_DTAG_EN (rwh) */
    Ifx_UReg_32Bit CPU5_PMEM_EN:1;    /**< \brief [27:27] CPU5 PMEM SSH instance Enable - CPU5_PMEM_EN (rwh) */
    Ifx_UReg_32Bit reserved_28:1;     /**< \brief [28:28] \internal Reserved */
    Ifx_UReg_32Bit reserved_29:1;     /**< \brief [29:29] \internal Reserved */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit reserved_31:1;     /**< \brief [31:31] \internal Reserved */
} Ifx_MTU_MEMTEST0_Bits;

/** \brief Memory MBISTEnable Register 1 */
typedef struct _Ifx_MTU_MEMTEST1_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit reserved_2:4;      /**< \brief [5:2] \internal Reserved */
    Ifx_UReg_32Bit reserved_6:1;      /**< \brief [6:6] \internal Reserved */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit reserved_8:1;      /**< \brief [8:8] \internal Reserved  */
    Ifx_UReg_32Bit SADMA_EN:1;        /**< \brief [9:9] SADMA SSH instance Enable - SADMA_EN (rwh) */
    Ifx_UReg_32Bit MINI_MCDS_EN:1;    /**< \brief [10:10] MINI MCDS memory SSH instance Enable - MINI_MCDS_EN (rwh) */
    Ifx_UReg_32Bit MCDS_EN:1;         /**< \brief [11:11] MCDS memory SSH instance Enable - MCDS_EN (rwh) */
    Ifx_UReg_32Bit EMEM0_EN:1;        /**< \brief [12:12] EMEM0 SSH instance Enable - EMEM0_EN (rwh) */
    Ifx_UReg_32Bit reserved_13:1;     /**< \brief [13:13] \internal Reserved */
    Ifx_UReg_32Bit EMEM2_EN:1;        /**< \brief [14:14] EMEM2 SSH instance Enable - EMEM2_EN (rwh) */
    Ifx_UReg_32Bit EMEM3_EN:1;        /**< \brief [15:15] EMEM3 SSH instance Enable - EMEM3_EN (rwh) */
    Ifx_UReg_32Bit EMEM_XTM_EN:1;     /**< \brief [16:16] EMEM XTM memory SSH instance Enable - EMEM_XTM_EN (rwh) */
    Ifx_UReg_32Bit SPU_BUFFER0_EN:1;    /**< \brief [17:17] SPU BUFFER0 SSH instance Enable - SPU_BUFFER0_EN (rwh) */
    Ifx_UReg_32Bit SPU_BUFFER1_EN:1;    /**< \brief [18:18] SPU BUFFER1 SSH instance Enable - SPU_BUFFER1_EN (rwh) */
    Ifx_UReg_32Bit SPU_CONFIG0_EN:1;    /**< \brief [19:19] SPU CONFIG0 memory SSH instance Enable - SPU_CONFIG0_EN (rwh) */
    Ifx_UReg_32Bit SPU_CONFIG1_EN:1;    /**< \brief [20:20] SPU CONFIG1 memory SSH instance Enable - SPU_CONFIG1_EN (rwh) */
    Ifx_UReg_32Bit GTM_FIFO_EN:1;     /**< \brief [21:21] GTM FIFO memory SSH instance Enable - GTM_FIFO_EN (rwh) */
    Ifx_UReg_32Bit GTM_MCS0SLOW_EN:1;    /**< \brief [22:22] GTM MCS0 SLOW memory SSH instance Enable - GTM_MCS0SLOW_EN (rwh) */
    Ifx_UReg_32Bit GTM_MCS0FAST_EN:1;    /**< \brief [23:23] GTM MCS0 FAST memory SSH instance Enable - GTM_MCS0FAST_EN (rwh) */
    Ifx_UReg_32Bit GTM_MCS1SLOW_EN:1;    /**< \brief [24:24] GTM MCS1 SLOW memory SSH instance Enable - GTM_MCS1SLOW_EN (rwh) */
    Ifx_UReg_32Bit GTM_MCS1FAST_EN:1;    /**< \brief [25:25] GTM MCS1 FAST memory SSH instance Enable - GTM_MCS1FAST_EN (rwh) */
    Ifx_UReg_32Bit GTM_DPLL1A_EN:1;    /**< \brief [26:26] GTM DPLL1A memory SSH instance Enable - GTM_DPLL1A_EN (rwh) */
    Ifx_UReg_32Bit GTM_DPLL1BC_EN:1;    /**< \brief [27:27] GTM DPLL1BC memory SSH instance Enable - GTM_DPLL1BC_EN (rwh) */
    Ifx_UReg_32Bit GTM_DPLL2_EN:1;    /**< \brief [28:28] GTM DPLL2 memory SSH instance Enable - GTM_DPLL2_EN (rwh) */
    Ifx_UReg_32Bit ETHERMAC_EN:1;     /**< \brief [29:29] ETHERMAC memory SSH instance Enable - ETHERMAC_EN (rwh) */
    Ifx_UReg_32Bit MCAN10_EN:1;       /**< \brief [30:30] MCAN10 memory SSH instance Enable - MCAN10_EN (rwh) */
    Ifx_UReg_32Bit MCAN11_EN:1;       /**< \brief [31:31] MCAN11 memory SSH instance Enable - MCAN11_EN (rwh) */
} Ifx_MTU_MEMTEST1_Bits;

/** \brief Memory MBISTEnable Register 2 */
typedef struct _Ifx_MTU_MEMTEST2_Bits
{
    Ifx_UReg_32Bit reserved_0:1;      /**< \brief [0:0] \internal Reserved */
    Ifx_UReg_32Bit reserved_1:1;      /**< \brief [1:1] \internal Reserved */
    Ifx_UReg_32Bit ERAY_OBF0_EN:1;    /**< \brief [2:2] ERAY OBF0 SSH instance Enable - ERAY_OBF0_EN (rwh) */
    Ifx_UReg_32Bit ERAY_OBF1_EN:1;    /**< \brief [3:3] ERAY OBF1 SSH instance Enable - ERAY_OBF1_EN (rwh) */
    Ifx_UReg_32Bit ERAY_TBF_IBF0_EN:1;    /**< \brief [4:4] ERAY TBF IBF0 memory SSH instance Enable - ERAY_TBF_IBF0_EN (rwh) */
    Ifx_UReg_32Bit ERAY_TBF_IBF1_EN:1;    /**< \brief [5:5] ERAY TBF IBF1 memory SSH instance Enable - ERAY_TBF_IBF1_EN (rwh) */
    Ifx_UReg_32Bit ERAY_MBF0_EN:1;    /**< \brief [6:6] ERAY MBF0 memory SSH instance Enable - ERAY_MBF0_EN (rwh) */
    Ifx_UReg_32Bit ERAY_MBF1_EN:1;    /**< \brief [7:7] ERAY MBF1 memory SSH instance Enable - ERAY_MBF1_EN (rwh) */
    Ifx_UReg_32Bit reserved_8:1;    /**< \brief [8:8] \internal Reserved */
    Ifx_UReg_32Bit reserved_9:1;      /**< \brief [9:9] \internal Reserved */
    Ifx_UReg_32Bit reserved_10:1;     /**< \brief [10:10] \internal Reserved */
    Ifx_UReg_32Bit reserved_11:1;      /**< \brief [11:11] \internal Reserved */
    Ifx_UReg_32Bit reserved_12:1;      /**< \brief [12:12] \internal Reserved */
    Ifx_UReg_32Bit SCR_XRAM_EN:1;     /**< \brief [13:13] SCR XRAM SSH instance Enable - SCR_XRAM_EN (rwh) */
    Ifx_UReg_32Bit SCR_RAMINT_EN:1;    /**< \brief [14:14] SCR Internal RAM SSH instance Enable - SCR_RAMINT_EN (rwh) */
    Ifx_UReg_32Bit CIF_JPEG1_4_EN:1;    /**< \brief [15:15] CIF JPEG_1_4 memorySSH instance Enable - CIF_JPEG1_4_EN (rwh) */
    Ifx_UReg_32Bit CIF_JPEG3_EN:1;    /**< \brief [16:16] CIF JPEG3 memorySSH instance Enable - CIF_JPEG3_EN (rwh) */
    Ifx_UReg_32Bit CIF_EN:1;          /**< \brief [17:17] CIF memorySSH instance Enable - CIF_EN (rwh) */
    Ifx_UReg_32Bit reserved_18:1;     /**< \brief [18:18] \internal Reserved */
    Ifx_UReg_32Bit reserved_19:1;     /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit reserved_20:1;     /**< \brief [20:20] \internal Reserved */
    Ifx_UReg_32Bit HSPDM_RAM_EN:1;    /**< \brief [21:21] HDSPDM RAM SSH instance Enable - HSPDM_RAM_EN (rwh) */
    Ifx_UReg_32Bit reserved_22:2;     /**< \brief [23:22] \internal Reserved */
    Ifx_UReg_32Bit SPU_FFT00_RAM_EN:1;    /**< \brief [24:24] SPU FFT00 RAM SSH instance Enable - SPU_FFT00_RAM_EN (rwh) */
    Ifx_UReg_32Bit SPU_FFT01_RAM_EN:1;    /**< \brief [25:25] SPU FFT01 RAM SSH instance Enable - SPU_FFT01_RAM_EN (rwh) */
    Ifx_UReg_32Bit SPU_FFT10_RAM_EN:1;    /**< \brief [26:26] SPU FFT10 RAM SSH instance Enable - SPU_FFT10_RAM_EN (rwh) */
    Ifx_UReg_32Bit SPU_FFT11_RAM_EN:1;    /**< \brief [27:27] SPU FFT11 RAM SSH instance Enable - SPU_FFT11_RAM_EN (rwh) */
    Ifx_UReg_32Bit SPU_FFT20_RAM_EN:1;    /**< \brief [28:28] SPU FFT20 RAM SSH instance Enable - SPU_FFT20_RAM_EN (rwh) */
    Ifx_UReg_32Bit SPU_FFT21_RAM_EN:1;    /**< \brief [29:29] SPU FFT21 RAM SSH instance Enable - SPU_FFT21_RAM_EN (rwh) */
    Ifx_UReg_32Bit SPU_FFT30_RAM_EN:1;    /**< \brief [30:30] SPU FFT30 RAM SSH instance Enable - SPU_FFT30_RAM_EN (rwh) */
    Ifx_UReg_32Bit SPU_FFT31_RAM_EN:1;    /**< \brief [31:31] SPU FFT31 RAM SSH instance Enable - SPU_FFT31_RAM_EN (rwh) */
} Ifx_MTU_MEMTEST2_Bits;

